platformio/platform-ststm32/misc/svd/STM32F769.svd
        <register>
          <name>HUFFBASE8</name>
          <displayName>HUFFBASE8</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1B0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE9</name>
          <displayName>HUFFBASE9</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE10</name>
          <displayName>HUFFBASE10</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1B8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE11</name>
          <displayName>HUFFBASE11</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE12</name>
          <displayName>HUFFBASE12</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE13</name>
          <displayName>HUFFBASE13</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE14</name>
          <displayName>HUFFBASE14</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE15</name>
          <displayName>HUFFBASE15</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE16</name>
          <displayName>HUFFBASE16</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE17</name>
          <displayName>HUFFBASE17</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE18</name>
          <displayName>HUFFBASE18</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1D8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE19</name>
          <displayName>HUFFBASE19</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE20</name>
          <displayName>HUFFBASE20</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE21</name>
          <displayName>HUFFBASE21</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE22</name>
          <displayName>HUFFBASE22</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE23</name>
          <displayName>HUFFBASE23</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE24</name>
          <displayName>HUFFBASE24</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1F0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE25</name>
          <displayName>HUFFBASE25</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE26</name>
          <displayName>HUFFBASE26</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1F8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE27</name>
          <displayName>HUFFBASE27</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE28</name>
          <displayName>HUFFBASE28</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE29</name>
          <displayName>HUFFBASE29</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE30</name>
          <displayName>HUFFBASE30</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE31</name>
          <displayName>HUFFBASE31</displayName>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x20C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffBase_RAM_0</name>
              <description>HuffBase RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>HuffBase_RAM_1</name>
              <description>HuffBase RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB0</name>
          <displayName>HUFFSYMB0</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB1</name>
          <displayName>HUFFSYMB1</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB2</name>
          <displayName>HUFFSYMB2</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB3</name>
          <displayName>HUFFSYMB3</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x21C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB4</name>
          <displayName>HUFFSYMB4</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB5</name>
          <displayName>HUFFSYMB5</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB6</name>
          <displayName>HUFFSYMB6</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB7</name>
          <displayName>HUFFSYMB7</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x22C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
